##############################################################
## Autor: David Fernández Fuster                            ##
## Data: 02/10/2022                                         ## 
## Funció: Adhereix Celery al context de l'aplicació Flask. ##
##############################################################

#!/usr/bin/env python
import os
from . import celery, init_app

app = init_app('config.ProdConfig')
app.app_context().push()
#######################################################################################################
#######################################################################################################